routes_controllers/app/controllers/artworks_controller.rb

SELECT "users".* FROM "users"
SELECT "artworks".* FROM "artworks"
---
    def index
        if params[:user_id]
            @artworks = Artwork.artworks_for_user_id(params[:user_id])

        else
            @artworks = Artwork.all

INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "SCREAM"], ["image_url", "SCREAM.com"], ["artist_id", 5], ["created_at", "2022-12-15 15:34:36.830249"], ["updated_at", "2022-12-15 15:34:36.830249"]]
---
    def create
        @artwork = Artwork.new(artwork_params)
        if @artwork.save

SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def show
        @artwork = Artwork.find(params[:id])

SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "image_url" = $2, "artist_id" = $3, "updated_at" = $4 WHERE "artworks"."id" = $5  [["title", "SCREAM"], ["image_url", "SCREAM.com"], ["artist_id", 5], ["updated_at", "2022-12-15 15:36:26.496723"], ["id", 2]]
---
    def update
        @artwork = Artwork.find(params[:id])
        @artwork.update(artwork_params)

SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 3]]
---
    def destroy
        @artwork = Artwork.find(params[:id])
        @artwork.destroy