routes_controllers/app/controllers/artwork_shares_controller.rb

    def create
        @artwork_share = ArtworkShare.new(artwork_share_params)
        if @artwork_share.save
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 1], ["viewer_id", 3], ["created_at", "2022-12-15 15:50:55.945050"], ["updated_at", "2022-12-15 15:50:55.945050"]]