routes_controllers/app/controllers/users_controller.rb

    def create
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Rex"], ["email", "Rex@rex.rex"], ["created_at", "2022-12-14 20:12:20.201417"], ["updated_at", "2022-12-14 20:12:20.201417"]]

    def update
        @user = User.find(params[:id])
        @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "rex"], ["email", "rex@rex.rex"], ["updated_at", "2022-12-14 22:07:17.078574"], ["id", 2]]